In [1]:
import pandas as pd

In [11]:
df = pd.read_csv('sales.csv', encoding='latin1')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [12]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [13]:
df['UnitPrice'].dtype

dtype('float64')

In [15]:
df["UnitPrice"].astype(int)           #pls check .dtype iske aage

dtype('int64')

##### Changing multiple columns ka datatype using a dictionary

In [18]:
df.astype({'UnitPrice' : 'int', 'CustomerID': 'int'}, errors='ignore')         #errors= ignore/raise

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4,12680.0,France

In [19]:
#pd.to_numeric() function  offers more robust error handling than astype.

In [21]:
test = pd.DataFrame({'Value': ['10', '20', 'invalid'], 'Date': ['2023-01-01', '2023-01-02', 'invalid_date']})
test

     Value          Date
0       10    2023-01-01
1       20    2023-01-02
2  invalid  invalid_date

In [26]:
pd.to_numeric(test['Value'], errors = 'coerce')             #coercing errors to NaN

0    10.0
1    20.0
2     NaN
Name: Value, dtype: float64

##### The errors='coerce' argument is particularly useful for handling invalid values by replacing them with NaN (for numeric) or NaT (for datetime/timedelta).

In [27]:
pd.to_datetime(test['Date'], errors = 'coerce')

0   2023-01-01
1   2023-01-02
2          NaT
Name: Date, dtype: datetime64[ns]

#### convert_dtypes() This method attempts to convert columns to the best possible data types,

In [28]:
test2 = pd.DataFrame({'Name': ['Alice', 'Bob', pd.NA], 'Age': [25, 30, pd.NA]})
test2

    Name   Age
0  Alice    25
1    Bob    30
2   <NA>  <NA>

In [32]:
test2.dtypes

Name    object
Age     object
dtype: object

In [33]:
test2.convert_dtypes()                 #pls try .dtypes

    Name   Age
0  Alice    25
1    Bob    30
2   <NA>  <NA>